Repository: weblate/celeste
Catalog: po/*.po
Languages: pt

source: App icons by
pt: Ícones por

source: Ok
pt: Aceitar

source: Both '{}' and '{}' are more recent than at last sync.
pt: '{}' e '{}' são ambos mais recentes que a última sincronização.

source: Unable to create Celeste's config directory [{}].
pt: Impossível criar a pasta de configuração do Celeste [{}].

source: Unable to create Celeste's database file [{}].
pt: Impossível criar a base de dados do Celeste [{}].

source: Unable to connect to database [{}].
pt: Impossível ligar à base de dados [{}].

source: Unable to run database migrations [{}]
pt: Impossível executar migrações de bases de dados [{}]

source: Awaiting sync check...
pt: A aguardar verificação da sincronização...

source: Sync Errors
pt: Erros de sincronização

source: File/Folder Exclusions
pt: Pastas/Ficheiros a excluir

source: Stop syncing this directory
pt: Parar sincronização desta pasta

source: Are you sure you want to stop syncing '{}' to '{}'?
pt: Tem a certeza de que deseja parar a sincronização de "{}" com "{}"?

source: This directory is currently being processed to no longer be synced.
pt: Esta pasta está em processamento para parar a sincronização.

source: Directories
pt: Pastas

source: Local folder:
pt: Pasta local:

source: Cancel
pt: Cancelar

source: Remote folder:
pt: Pasta remota:

source: The specified remote directory doesn't exist
pt: A pasta remota pedida não existe

source: Failed to check if the specified remote directory exists
pt: Falha ao verificar a existência da pasta remota

source: The specified directory pair is already being synced
pt: O par de pastas especificado já está sincronizado

source: The specified local directory doesn't exist
pt: A pasta local especificada não existe

source: The specified local path isn't a directory
pt: O caminho local especificado não é uma pasta

source: The specified local directory needs to be an absolute path
pt: A pasta local especificada tem de ser um caminho absoluto

source: Are you sure you want to delete this remote?
pt: Deseja realmente eliminar esta remota?

source: All the directories associated with this remote will also stop syncing.
pt: Todas as pastas associadas a esta remota deixam também de sincronizar.

source: Files are synced.
pt: Os ficheiros estão sincronizados.

source: Syncing '{}'...
pt: A sincronizar "{}"...

source: Checking for changes...
pt: A procurar alterações...

source: Please resolve the reported syncing issues.
pt: Por favor, resolva os problemas assinalados.

source: {} errors found.
pt: {} erros encontrados.

source: Would you like to dismiss this error?
pt: Deseja descartar o erro?

source: Failed to sync '{}' to '{}' on remote.
pt: Falha ao sincronizar "{}" com "{}" na remota.

source: Failed to sync '{}' on remote to '{}'.
pt: Falha ao sincronizar "{}" na remota com "{}".

source: Unable to fetch data for '{}' from the remote.
pt: Impossível obter dados de "{}" a partir da remota.

source: File Update
pt: Actualização do ficheiro

source: Neither the local item or remote item exists anymore. This error will now be removed.
pt: Nem o item local, nem o remoto existem. O erro será removido.

source: Only the local item exists now, so it will be synced to the remote.
pt: Só o item local existe, será sincronizado com o remoto.

source: Only the remote item exists now, so it will be synced to the local machine.
pt: Só o item remoto existe, será sincronizado com o local.

source: Both the local item '{}' and remote item '{}' have been updated since the last sync.
pt: Tanto o item "{}" local, como o "{}" remoto foram alterados desde a última sincronização.

source: Which item would you like to keep?
pt: Qual deles deseja manter?

source: Local
pt: O local

source: Remote
pt: O remoto

source: 1 error found.
pt: 1 erro encontrado.

source: {} errors found.
pt: {} erros encontrados.

source: Checking '{}' for changes...
pt: A verificar alterações a "{}"...

source: Checking '{}' on remote for changes...
pt: A verificar alterações a "{}" remoto...

source: Finished sync checks with {} errors.
pt: Verificações de sincronização concluídas com {} erros.

source: Finished sync checks.
pt: Verificações de sincronização concluídas.

source: Authenticating to {}...
pt: A autenticar em {}...

source: Follow the link that opened in your browser, and come back once you've finished.
pt: Siga a ligação aberta no seu navegador, e volte aqui uma vez terminado.

source: There was an issue while running the webserver for authentication
pt: Houve um problema de autenticação no servidor web

source: There was an issue authenticating to {}
pt: Houve um problema ao autenticar em {}

source: Name
pt: Nome

source: Name already exists.
pt: O nome já existe.

source: Invalid name. Names must: - Only contain numbers, letters, '_', '-', '.', and spaces - Not start with '-' or a space - Not end with a space
pt: Nome inválido. Os nomes: - só podem conter algarismos, letras, '_', '-', '.', e espaços; - não podem começar por '-' ou espaço; - não podem terminar com espaços

source: Server URL
pt: Endereço do servidor

source: Invalid server URL ({}).
pt: Endereço do servidor ({}) incorrecto.

source: Invalid server URL (no domain specified).
pt: Endereço do servidor inválido (não especificou o domínio).

source: Invalid server URL (password was specified).
pt: Endereço do servidor inválido (especificou uma senha).

source: Invalid server URL(unknown server scheme {}).
pt: Endereço do servidor inválido (esquema de servidor {} desconhecido).

source: Don't specify '{}' as part of the URL.
pt: Não especifique "{}" como parte do endereço.

source: Username
pt: Utilizador

source: Password
pt: Senha

source: 2FA Code
pt: Código 2FA

source: The provided 2FA code is invalid (should only contain digits).
pt: O código 2FA é inválido (só deve conter algarismos).

source: The provided 2FA code is invalid (should be 6 digits long).
pt: O código 2FA é inválido (deve ter seis algarismos).

source: Log in
pt: Iniciar sessão

source: Unable to connect to the server. Check your internet connection and try again.
pt: Impossível ligar ao servidor. Verifique a ligação à Internet e tente de novo.

source: A 2FA code is required to log in to this account. Provide one and try again.
pt: É necessário um código 2FA para esta conta. Forneça-o e tente de novo.

source: Unable to authenticate to the server. Check your login credentials and try again.
pt: Impossível autenticar no servidor. Verifique as credenciais e tente de novo.

source: Unable to log in
pt: Impossível iniciar sessão

source: Server Type
pt: Tipo de servidor

source: Awaiting sync checks...
pt: A aguardar verificações de sincronização...

source: Open
pt: Abrir

source: Close
pt: Fechar

source: Unknown Error
pt: Erro desconhecido

source: An unknown error has occurred while running. This is an internal issue with Celeste and should be reported. The following backtrace may help with debugging the issue - note that it may contain information such as login tokens/keys, so avoid posting the information publicly:
pt: Ocorreu um erro desconhecido durante a execução. Este é um problema interno da Celeste e deve ser reportado. O seguinte backtrace pode ajudar a resolver o problema - tenha em atenção que pode conter informações como tokens/chaves de início de sessão, por isso evite publicar as informações:
